src/main/resources/xml/accommodationSalesServicePort/validatePayment/validatePayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:validatePayment>
         <paymentRequest>
            <!--1 or more repetitions:-->
            <pointsPayments>
               <payingContractSummary>
                  <!--Zero or more repetitions:-->
                  <payingContracts>
                     <contractId>?</contractId>
                     <contractType>?</contractType>
                     <paymentSequence>?</paymentSequence>
                     <virtualContractId>?</virtualContractId>
                     <useYear>?</useYear>
                  </payingContracts>
                  <pointStateId>?</pointStateId>
                  <!--1 or more repetitions:-->
                  <paymentOrderDetails>
                     <fufillmentDate>?</fufillmentDate>
                     <currencyType>?</currencyType>
                     <value>?</value>
                  </paymentOrderDetails>
               </payingContractSummary>
               <totalPointsToCharge>?</totalPointsToCharge>
               <useYear>?</useYear>
            </pointsPayments>
            <membershipId>?</membershipId>
            <inventoryTrackingId>?</inventoryTrackingId>
            <!--Optional:-->
            <bookAndPay>?</bookAndPay>
            <!--Optional:-->
            <paymentDescription>?</paymentDescription>
            <!--Optional:-->
            <overrideCode>?</overrideCode>
            <basicOrderDetails>
               <reservationType>?</reservationType>
               <!--Optional:-->
               <resortCode>?</resortCode>
               <!--Optional:-->
               <resortType>?</resortType>
               <!--Optional:-->
               <reservationNumber>?</reservationNumber>
               <!--Optional:-->
               <reservationReferenceNo>?</reservationReferenceNo>
               <homeType>?</homeType>
               <arrivalDate>?</arrivalDate>
               <departureDate>?</departureDate>
               <!--Optional:-->
               <bookingDate>?</bookingDate>
            </basicOrderDetails>
         </paymentRequest>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:validatePayment>
   </soapenv:Body>
</soapenv:Envelope>